w9/day5/projects/music_app/app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "conleyp"], ["password_digest", "$2a$10$C36j27OzinVLJqsvUULO7uEYd8ec.q1X0Rmed9yVqVIDq83XSNPw6"], ["session_token", "KZdvoN8vsBgeGWaZO--0SA"]]
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "FfKusOGV_eom8yxKKy14sQ"], ["id", 4]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!