w9/day1/project/first_routes/app/controllers/artworks_controller.rb

  def index
    render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def create
    artwork = Artwork.new(valid_params)
    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Starry Night"], ["image_url", "https://artwork.com"], ["artist_id", 272], ["created_at", "2019-04-08 22:42:13.150126"], ["updated_at", "2019-04-08 22:42:13.150126"]]

  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(valid_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 240], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Starry Night"], ["updated_at", "2019-04-08 22:49:17.290700"], ["id", 240]]