w9/day1/project/first_routes/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 272], ["LIMIT", 1]]
---
  def index
    to_render = []
    user = User.find(params[:user_id])