w9/day1/project/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if valid_params.include?(:username)
      users = User.find_by_search(valid_params[:username])
    else
      users = User.all

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-04-08 22:28:39.172386"], ["updated_at", "2019-04-08 22:28:39.172386"], ["username", "imauser!"]]
---
  def create
    user = User.new(valid_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 287], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "anewemail@email.com"], ["updated_at", "2019-04-08 20:50:15.102559"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    if user.update(valid_params)