w9/day5/projects/music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "FfKusOGV_eom8yxKKy14sQ"], ["LIMIT", 1]]
---
  def current_user
    @user = User.find_by(session_token: session[:session_token])