w9/day5/projects/music_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "conleyp"], ["password_digest", "$2a$10$C36j27OzinVLJqsvUULO7uEYd8ec.q1X0Rmed9yVqVIDq83XSNPw6"], ["session_token", "KZdvoN8vsBgeGWaZO--0SA"]]