w9/day3/project/ninetyninecats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @cat = Cat.find(params[:id])